app/controllers/addresses_controller.rb

  def index
    @addresses = Address.all
    render json: @addresses.map { AddressSerializer.new(_1) }
---
SELECT "addresses".* FROM "addresses"

  def create
    @address = Address.new(address_params)

    if @address.save
---
INSERT INTO "addresses" ("link", "place", "cep", "number", "address", "complement", "neighborhood", "city", "state", "created_at", "updated_at") VALUES ('https://maps.example.com/123', 'Edifício Central', '01310-100', '1000', 'Av. Paulista', 'Apto 42', 'Bela Vista', 'São Paulo', 'SP', '2026-05-01 21:09:25.906076', '2026-05-01 21:09:25.906076') RETURNING "id"

  def update
    if @address.update(address_params)
---
UPDATE "addresses" SET "link" = 'https://maps.example.com/1233', "updated_at" = '2026-05-01 21:16:18.868065' WHERE "addresses"."id" = '544edb78-8330-4c1a-82f2-ade2e1ea766d'

  def destroy
    if @address.destroy
---
DELETE FROM "addresses" WHERE "addresses"."id" = '3b55da52-3f84-447c-8c2d-dc5ffb204f9c'

    def set_address
      @address = Address.find(params.expect(:id))
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = '3b55da52-3f84-447c-8c2d-dc5ffb204f9c' LIMIT 1