app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
---
  def paginate
    @pagy, @customers = pagy(apply_access_scope(Customer.includes(:address).all))

SELECT "customers".* FROM "customers"
---
  def index
    @customers = apply_access_scope(Customer.includes(:address).all)

INSERT INTO "customers" ("address_id", "name", "email", "tax_id", "phone", "created_at", "updated_at") VALUES ('384b6cf1-65eb-4249-95ea-dd93697e5b8f', 'João Silva', 'joao@email.com', '123.456.789-00', '11999999999', '2026-05-01 22:52:54.485591', '2026-05-01 22:52:54.485591') RETURNING "id"
---
  def create
    @customer = Customer.new(customer_params)

    if @customer.save

DELETE FROM "customers" WHERE "customers"."id" = '4285ad68-7d11-4a4a-bf87-7e86ec5dbddb'
---
  def destroy
    @customer.destroy!

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = '5990a793-df8a-4c4d-8299-951051d9d5e2'
SELECT "customers".* FROM "customers" WHERE "customers"."id" = NULL LIMIT 1
---
    def set_customer
      @customer = Customer.includes(:address).find(params.expect(:id))